/* 

git init = инициализирует репозиторий

git remote add origin https://github.com/ivan1986mrpl/test-repo.git = связывает локальный репозиторий с удаленным

git status = показывает в какой сейчас ветке и какие файлы изменены или добавлены на локальном репозитории

git add -A или <название файла> = добавляет файлы в состояние перед комитом

git commit -m'init: add readme file' = добавляет контрольную точку 

git push -u origin main = (origin = ссылка на ваш github) (main = название ветки, в которую пушим)

git clone https://github.com/ivan1986mrpl/test-repo.git = клонирование репозитория в новую папку (клонирует не все ветки)

git add -A = берет весь репозиторий, не смотря на то, где вы находитесь локально в терминале

git add . = можно использовать, если находитесь на самом высшем уровне в терминале

новая ветка создается в интерфейсе github

git branch = посмотреть названия веток

git fetch = все ветки с изменениями из удаленного репозитория выкачивает и заливает вам в локальный репозиторий

git checkout fix1 = переключиться на ветку fix1

git checkout main = переключиться в ветку main

перед переключением в другую ветку обязательно комитить изменения

git checkout -b fix2 = создание новой ветки fix2 из терминала


*/
